app/Controllers/Admin.php

    public function dashboard(): string
    {
        // Mendapatkan tanggal hari ini dengan DateTime
        $today = (new \DateTime())->format('Y-m-d'); // Format ke 'YYYY-MM-DD'

        // Mengambil pemasukan harian
        $pemasukanharian = $this->transaksiModel
            ->where('id_jenis_transaksi', 1)
            ->where('id_status_transaksi', 2)
            ->where('DATE(updated_at)', $today) // Filter berdasarkan tanggal hari ini
            ->selectSum('nominal_transaksi') // Menggunakan selectSum() untuk menghitung jumlah
            ->first(); // Ambil hasilnya dalam bentuk array, karena selectSum() mengembalikan array

        // Mengambil pengeluaran harian
        $pengeluaranharian = $this->transaksiModel
            ->where('id_jenis_transaksi', 2)
            ->where('id_status_transaksi', 2)
            ->where('DATE(updated_at)', $today) // Filter berdasarkan tanggal hari ini
            ->selectSum('nominal_transaksi') // Menggunakan selectSum() untuk menghitung jumlah
            ->first();

        // Mengambil pemasukan bulanan
        $pemasukanbulanan = $this->transaksiModel
            ->where('id_jenis_transaksi', 1)
            ->where('id_status_transaksi', 2)
            ->where('MONTH(updated_at)', date('m')) // Filter berdasarkan bulan saat ini
            ->selectSum('nominal_transaksi') // Menggunakan selectSum() untuk menghitung jumlah
            ->first();

        // Mengambil pengeluaran bulanan
        $pengeluaranbulanan = $this->transaksiModel
            ->where('id_jenis_transaksi', 2)
            ->where('id_status_transaksi', 2)
            ->where('MONTH(updated_at)', date('m')) // Filter berdasarkan bulan saat ini
            ->selectSum('nominal_transaksi') // Menggunakan selectSum() untuk menghitung jumlah
            ->first();

        $transaksipending = $this->transaksiModel
            ->select('transaksi.*, status_transaksi.*, jenis_transaksi.*, siswa.*')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('siswa', 'siswa.id_siswa = transaksi.id_siswa')
            ->where('transaksi.id_status_transaksi', 1)  // Memastikan menggunakan id_status_transaksi dari tabel transaksi
            ->findAll();
---
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 1
AND `id_status_transaksi` = 2
AND DATE(updated_at) = '2024-12-10'
 LIMIT 1
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 2
AND `id_status_transaksi` = 2
AND DATE(updated_at) = '2024-12-10'
 LIMIT 1
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 1
AND `id_status_transaksi` = 2
AND MONTH(updated_at) = '12'
 LIMIT 1
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 2
AND `id_status_transaksi` = 2
AND MONTH(updated_at) = '12'
 LIMIT 1
SELECT `transaksi`.*, `status_transaksi`.*, `jenis_transaksi`.*, `siswa`.*
FROM `transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `siswa` ON `siswa`.`id_siswa` = `transaksi`.`id_siswa`
WHERE `transaksi`.`id_status_transaksi` = 1

    public function read_kelas(): string
    {
        $kelas = $this->kelasModel->findAll();
---
SELECT *
FROM `kelas`

    public function read_pengumuman()
    {
        $pengumuman = $this->pengumumanModel->findAll();
---
SELECT *
FROM `pengumuman`

    public function action_edit_pengumuman()
    {
        $id_pengumuman = $this->request->getPost('id_pengumuman');

        // Fetch the data for the pengumuman using the ID
        $pengumuman = $this->pengumumanModel->find($id_pengumuman);

        if (!$pengumuman) {
            // If the pengumuman not found, redirect with error message
            return redirect()->to(base_url('admin/read_pengumuman'))
                ->with('error', 'Pengumuman tidak ditemukan');
        }

        // If a new file was uploaded, handle it
        $file = $this->request->getFile('pengumuman');  // 'bukti' is the input name for file upload

        if ($file && $file->isValid() && !$file->hasMoved()) {
            // Move the file to the 'bukti' directory
            $file->move('assets/pdf', $file->getName());

            // Update the filename in the database (assuming 'pengumuman' is the column storing file name)
            $file_name = $file->getName();

            // Update pengumuman record in the database
            $this->pengumumanModel->update($id_pengumuman, [
                'nama_pengumuman' => $file_name  // Assuming the 'pengumuman' field stores the filename
            ]);
---
SELECT *
FROM `pengumuman`
WHERE `pengumuman`.`id_pengumuman` = '1'
UPDATE `pengumuman` SET `nama_pengumuman` = 'Data Transaksi.pdf'
WHERE `pengumuman`.`id_pengumuman` IN ('1')