app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'ea'
 LIMIT 1
---
    public function action_login()
{
    // Mendapatkan username dan password dari form input
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    // Mencari user berdasarkan username
    $user = $this->userModel->where('username', $username)->first();