app/Controllers/User.php

SELECT *
FROM `user`
JOIN `siswa` ON `siswa`.`id_siswa` = `user`.`id_siswa`
WHERE `id_user` = '6'
 LIMIT 1
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 1
AND `id_siswa` = '1'
AND `id_status_transaksi` = 2
AND MONTH(created_at) >= 7
AND MONTH(created_at) <= 12
AND YEAR(created_at) = '2024'
 LIMIT 1
SELECT SUM(`nominal_transaksi`) AS `nominal_transaksi`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 1
AND `id_siswa` = '1'
AND `id_status_transaksi` = 2
AND MONTH(created_at) >= 1
AND MONTH(created_at) <= 6
AND YEAR(created_at) = '2024'
 LIMIT 1
---
    public function dashboard(): string
    {
        // Mengambil data user berdasarkan session id_user
        $userData = $this->userModel
            ->where('id_user', session()->get('id_user'))  // Gunakan session() untuk CI4
            ->join('siswa', 'siswa.id_siswa = user.id_siswa')
            ->first();

        $id_siswa = $userData['id_siswa'];

        // Mengambil transaksi untuk semester ganjil (Juli - Desember) pada tahun yang sama
        $semesterganjil = $this->transaksiModel
            ->where('id_jenis_transaksi', 1)
            ->where('id_siswa', $id_siswa)  // Gunakan session() untuk CI4
            ->where('id_status_transaksi', 2)
            ->where('MONTH(created_at) >= 7') // Juli
            ->where('MONTH(created_at) <= 12') // Desember
            ->where('YEAR(created_at)', date('Y')) // Tahun yang sama dengan tahun sekarang
            ->selectSum('nominal_transaksi')  // Sum transaksi
            ->first(); // Ambil data pertama (atau null jika tidak ada)

        // Extract the sum value from the result
        $semesterganjil = $semesterganjil ? $semesterganjil['nominal_transaksi'] : 0;

        // Mengambil transaksi untuk semester genap (Januari - Juni) pada tahun yang sama
        $semestergenap = $this->transaksiModel
            ->where('id_jenis_transaksi', 1)
            ->where('id_siswa', $id_siswa)  // Gunakan session() untuk CI4
            ->where('id_status_transaksi', 2)
            ->where('MONTH(created_at) >= 1') // Januari
            ->where('MONTH(created_at) <= 6') // Juni
            ->where('YEAR(created_at)', date('Y')) // Tahun yang sama dengan tahun sekarang
            ->selectSum('nominal_transaksi')  // Sum transaksi
            ->first(); // Ambil data pertama (atau null jika tidak ada)

SELECT *
FROM `kelas`
JOIN `siswa` ON `siswa`.`id_kelas` = `kelas`.`id_kelas`
WHERE `siswa`.`id_siswa` = '1'
 LIMIT 1
---
        // Extract the sum value from the result
        $semestergenap = $semestergenap ? $semestergenap['nominal_transaksi'] : 0;

        $kelasData = $this->kelasModel
            ->join('siswa', 'siswa.id_kelas = kelas.id_kelas')
            ->where('siswa.id_siswa', $id_siswa)
            ->first();

SELECT *
FROM `user`
JOIN `siswa` ON `siswa`.`id_siswa` = `user`.`id_siswa`
WHERE `id_user` = '6'
 LIMIT 1
SELECT *
FROM `transaksi`
LEFT JOIN `siswa` ON `siswa`.`id_siswa` = `transaksi`.`id_siswa`
LEFT JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
LEFT JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `transaksi`.`id_siswa` = '1'
---
    public function read_transaksi()
    {
        $userData = $this->userModel
            ->where('id_user', session()->get('id_user'))  // Gunakan session() untuk CI4
            ->join('siswa', 'siswa.id_siswa = user.id_siswa')
            ->first();

        $id_siswa = $userData['id_siswa'];

        $transaksi = $this->transaksiModel
            ->join('siswa', 'siswa.id_siswa = transaksi.id_siswa', 'left')  // LEFT JOIN
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi', 'left')  // LEFT JOIN
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi', 'left')  // LEFT JOIN
            ->where('transaksi.id_siswa', $id_siswa)  // Filter transaksi berdasarkan id_siswa
            ->findAll();  // Mengambil semua transaksi

SELECT *
FROM `user`
JOIN `siswa` ON `siswa`.`id_siswa` = `user`.`id_siswa`
WHERE `id_user` = '6'
 LIMIT 1
---
    public function create_transaksi()
    {
        $userData = $this->userModel
            ->where('id_user', session()->get('id_user'))  // Gunakan session() untuk CI4
            ->join('siswa', 'siswa.id_siswa = user.id_siswa')
            ->first();

SELECT *
FROM `user`
JOIN `siswa` ON `siswa`.`id_siswa` = `user`.`id_siswa`
WHERE `id_user` = '6'
 LIMIT 1
SELECT *
FROM `pengumuman`
 LIMIT 1
---
    public function pengumuman()
    {
        $userData = $this->userModel
            ->where('id_user', session()->get('id_user'))
            ->join('siswa', 'siswa.id_siswa = user.id_siswa')
            ->first();

        // Ambil pengumuman pertama (atau sesuaikan dengan query Anda)
        $pengumuman = $this->pengumumanModel->first();